{"keras_version": "2.1.5", "class_name": "Model", "backend": "tensorflow", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "input_1"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "separable_conv2d_8", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_8", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "separable_conv2d_1", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 16, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]], "name": "batch_normalization_8", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_8", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]], "name": "batch_normalization_1", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_1", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "name": "activation_8", "config": {"trainable": true, "activation": "tanh", "name": "activation_8"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "name": "activation_1", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "name": "max_pooling2d_1", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_1"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "name": "average_pooling2d_1", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_1"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "name": "separable_conv2d_9", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_9", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["average_pooling2d_1", 0, 0, {}]]], "name": "separable_conv2d_2", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_9", 0, 0, {}]]], "name": "batch_normalization_9", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_9", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]], "name": "batch_normalization_2", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_2", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]], "name": "activation_9", "config": {"trainable": true, "activation": "tanh", "name": "activation_9"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "name": "activation_2", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "name": "separable_conv2d_10", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_10", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "name": "separable_conv2d_3", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_3", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_10", 0, 0, {}]]], "name": "batch_normalization_10", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_10", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]], "name": "batch_normalization_3", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_3", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]], "name": "activation_10", "config": {"trainable": true, "activation": "tanh", "name": "activation_10"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "name": "activation_3", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "name": "max_pooling2d_2", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_2"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "name": "average_pooling2d_2", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_2"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "separable_conv2d_11", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_11", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "separable_conv2d_4", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_4", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_11", 0, 0, {}]]], "name": "batch_normalization_11", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_11", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]], "name": "batch_normalization_4", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_4", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]], "name": "activation_11", "config": {"trainable": true, "activation": "tanh", "name": "activation_11"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "name": "activation_4", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "name": "separable_conv2d_12", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_12", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "name": "separable_conv2d_5", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_5", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_12", 0, 0, {}]]], "name": "batch_normalization_12", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_12", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]], "name": "batch_normalization_5", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_5", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]], "name": "activation_12", "config": {"trainable": true, "activation": "tanh", "name": "activation_12"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "name": "activation_5", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "name": "max_pooling2d_3", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_3"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "name": "average_pooling2d_3", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_3"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "separable_conv2d_13", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_13", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "separable_conv2d_6", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_6", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_13", 0, 0, {}]]], "name": "batch_normalization_13", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_13", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]], "name": "batch_normalization_6", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_6", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]], "name": "activation_13", "config": {"trainable": true, "activation": "tanh", "name": "activation_13"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "name": "activation_6", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "name": "separable_conv2d_14", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_14", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "SeparableConv2D", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "name": "separable_conv2d_7", "config": {"depthwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "linear", "depthwise_constraint": null, "padding": "same", "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "pointwise_regularizer": null, "kernel_size": [3, 3], "pointwise_constraint": null, "name": "separable_conv2d_7", "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "depth_multiplier": 1, "trainable": true, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "data_format": "channels_last", "depthwise_regularizer": null}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_14", 0, 0, {}]]], "name": "batch_normalization_14", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_14", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "BatchNormalization", "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]], "name": "batch_normalization_7", "config": {"gamma_initializer": {"class_name": "Ones", "config": {}}, "center": true, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "name": "batch_normalization_7", "beta_constraint": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "axis": -1, "beta_regularizer": null, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]], "name": "activation_14", "config": {"trainable": true, "activation": "tanh", "name": "activation_14"}}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "name": "activation_7", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "name": "conv2d_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_1", "use_bias": true, "kernel_size": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "name": "conv2d_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_2", "use_bias": true, "kernel_size": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]], "name": "conv2d_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_3", "use_bias": true, "kernel_size": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_3", 0, 0, {}]]], "name": "conv2d_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_4", "use_bias": true, "kernel_size": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "name": "conv2d_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_5", "use_bias": true, "kernel_size": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_2", 0, 0, {}]]], "name": "conv2d_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "filters": 64, "strides": [1, 1], "dilation_rate": [1, 1], "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "conv2d_6", "use_bias": true, "kernel_size": [1, 1], "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "padding": "valid"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]], "name": "max_pooling2d_4", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_4"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]], "name": "average_pooling2d_4", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_4"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]], "name": "max_pooling2d_5", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_5"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]], "name": "average_pooling2d_5", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_5"}}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]], "name": "max_pooling2d_6", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "max_pooling2d_6"}}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]], "name": "average_pooling2d_6", "config": {"padding": "valid", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "trainable": true, "name": "average_pooling2d_6"}}, {"class_name": "Multiply", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["average_pooling2d_4", 0, 0, {}]]], "name": "multiply_1", "config": {"trainable": true, "name": "multiply_1"}}, {"class_name": "Multiply", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}], ["average_pooling2d_5", 0, 0, {}]]], "name": "multiply_2", "config": {"trainable": true, "name": "multiply_2"}}, {"class_name": "Multiply", "inbound_nodes": [[["max_pooling2d_6", 0, 0, {}], ["average_pooling2d_6", 0, 0, {}]]], "name": "multiply_3", "config": {"trainable": true, "name": "multiply_3"}}, {"class_name": "Flatten", "inbound_nodes": [[["multiply_1", 0, 0, {}]]], "name": "flatten_1", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Flatten", "inbound_nodes": [[["multiply_2", 0, 0, {}]]], "name": "flatten_2", "config": {"trainable": true, "name": "flatten_2"}}, {"class_name": "Flatten", "inbound_nodes": [[["multiply_3", 0, 0, {}]]], "name": "flatten_3", "config": {"trainable": true, "name": "flatten_3"}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_3", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_6", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_6", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dense_9", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "relu", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_9", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 9}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_1", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_4", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_4", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dense_7", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_7", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "name": "dense_2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_2", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "name": "dense_5", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_5", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6}}, {"class_name": "Dense", "inbound_nodes": [[["flatten_3", 0, 0, {}]]], "name": "dense_8", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "dense_8", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 6}}, {"class_name": "Reshape", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "name": "reshape_1", "config": {"trainable": true, "target_shape": [3, 3], "name": "reshape_1"}}, {"class_name": "Reshape", "inbound_nodes": [[["dense_6", 0, 0, {}]]], "name": "reshape_2", "config": {"trainable": true, "target_shape": [3, 3], "name": "reshape_2"}}, {"class_name": "Reshape", "inbound_nodes": [[["dense_9", 0, 0, {}]]], "name": "reshape_3", "config": {"trainable": true, "target_shape": [3, 3], "name": "reshape_3"}}, {"class_name": "Dense", "inbound_nodes": [[["dense_1", 0, 0, {}]]], "name": "delta_s1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "delta_s1", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Dense", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "name": "delta_s2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "delta_s2", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Dense", "inbound_nodes": [[["dense_7", 0, 0, {}]]], "name": "delta_s3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "delta_s3", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Dense", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "name": "local_delta_stage1", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "local_delta_stage1", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Dense", "inbound_nodes": [[["dense_5", 0, 0, {}]]], "name": "local_delta_stage2", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "local_delta_stage2", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Dense", "inbound_nodes": [[["dense_8", 0, 0, {}]]], "name": "local_delta_stage3", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "activation": "tanh", "kernel_constraint": null, "use_bias": true, "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "name": "local_delta_stage3", "bias_constraint": null, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3}}, {"class_name": "Lambda", "inbound_nodes": [[["reshape_1", 0, 0, {}], ["reshape_2", 0, 0, {}], ["reshape_3", 0, 0, {}], ["delta_s1", 0, 0, {}], ["delta_s2", 0, 0, {}], ["delta_s3", 0, 0, {}], ["local_delta_stage1", 0, 0, {}], ["local_delta_stage2", 0, 0, {}], ["local_delta_stage3", 0, 0, {}]]], "name": "pred_pose", "config": {"function_type": "lambda", "output_shape": null, "function": ["4wUAAAAAAAAAEAAAAAcAAABTAAAAcywCAAB8AABkAQAZZAAAZAAAhQIAZAAAZAAAhQIAZAEAZgMA\nGWQBABR9BQB8AABkAQAZZAAAZAAAhQIAZAAAZAAAhQIAZAEAZgMAGWQBABR9BgB8AABkAQAZZAAA\nZAAAhQIAZAAAZAAAhQIAZAEAZgMAGWQBABR9BwB8AQBkAgAafQgAfAIAZAIAGn0JAHwDAGQCABp9\nCgBkAwB9CwB4TgB0AABkAQB8AQCDAgBEXT0AfQwAfAUAfAwAfAgAGHwAAGQEABkXfAAAZAEAGWQA\nAGQAAIUCAGQAAGQAAIUCAHwMAGYDABkUF30FAHGpAFd8BQB8AQBkBQB8BAB8AABkBgAZFBcUG30F\nAHhOAHQAAGQBAHwCAIMCAERdPQB9DQB8BgB8DQB8CQAYfAAAZAcAGRd8AABkBQAZZAAAZAAAhQIA\nZAAAZAAAhQIAfA0AZgMAGRQXfQYAcRQBV3wGAHwBAGQFAHwEAHwAAGQGABkUFxQbfAIAZAUAfAQA\nfAAAZAgAGRQXFBt9BgB4TgB0AABkAQB8AwCDAgBEXT0AfQ4AfAcAfA4AfAoAGHwAAGQJABkXfAAA\nZAIAGWQAAGQAAIUCAGQAAGQAAIUCAHwOAGYDABkUF30HAHGTAVd8BwB8AQBkBQB8BAB8AABkBgAZ\nFBcUG3wCAGQFAHwEAHwAAGQIABkUFxQbfAMAZAUAfAQAfAAAZAoAGRQXFBt9BwB8BQB8BgAXfAcA\nF3wLABR9DwB8DwBTKQtO6QAAAADpAgAAAOljAAAA6QYAAADpAQAAAOkDAAAA6QcAAADpBAAAAOkI\nAAAA6QUAAAApAdoFcmFuZ2UpENoBeNoCczHaAnMy2gJzM9oIbGFtYmRhX2TaAWHaAWLaAWPaAmRp\n2gJkatoCZGvaAVbaAWnaAWraAWvaBHByZWSpAHIcAAAA+m4vbWVkaWEvc2hhbWFuZ2FyeS8zNmI3\nYjc0MS01ZGQ3LTQ3ZWEtYWQ5OC0wYzVjZWIwNzY4ZjAvY29kZURlbW8yL2hlYWRfcG9zZS90cmFp\nbmluZ19hbmRfdGVzdGluZy9VUk5FVF9tb2RlbC5wedoKU1NSX21vZHVsZXcCAABzJAAAAAABJwEn\nAScCCgEKAQoCBgMWATsCGgIWATsCLgIWATsCQgISAg==\n", null, null], "arguments": {"s1": 3, "s3": 3, "lambda_d": 1, "s2": 3}, "trainable": true, "name": "pred_pose", "output_shape_type": "raw"}}], "output_layers": [["pred_pose", 0, 0]], "name": "model_1", "input_layers": [["input_1", 0, 0]]}}